#!/bin/bash
#################################################################################################
# 帮助信息模块
#################################################################################################

# 加载依赖
source "$(dirname "$0")/config.sh" 2>/dev/null || source "./lib/config.sh"
source "$(dirname "$0")/constants.sh" 2>/dev/null || source "./lib/constants.sh"

#################################################################################################
# 显示版本信息
#################################################################################################
print_version(){
    echo "Version : $this_version "
    return 0
}

#################################################################################################
# 常规print_usage 的内容
#################################################################################################
print_Usage(){
    echo -ne "${GREEN}
    --help ${NC}或${GREEN} -h    ${NC}显示帮助信息${GREEN}
    --version ${NC}或${GREEN} -v ${NC}显示版本信息${GREEN}
    --test ${NC}或${GREEN} -t    ${NC}程序启动后执行test函数的功能,用以开发和测试特定功能. ${GREEN}
    --trace         ${NC}追踪模式.临时文件一律保留,日志输出最为详尽.用以排查问题.${GREEN} 
    ${NC}"
    echo 
}

#################################################################################################
# 项目使用说明
#################################################################################################
project_PJ_usage(){
    echo -ne "${GREEN}
    --project ${BLUE}PJ_project_code    ${NC}执行项目代码${BLUE}PJ_project_code${NC}对应的函数
                        例:     ${GREEN}$0 --project ${BLUE} PJ_1234 

    ${NC}"
    echo 
}

#################################################################################################
# 帮助信息显示函数
#################################################################################################
print_help(){
    echo "==========================================================================" 
    echo 
    echo -ne "${WHITE}使用方法: "
    echo -ne "${WHITE}

    $0 ${GREEN}  [选项]  ${BLUE}参数...${GREEN}
    ${NC}"
    echo 

    # 遍历所有定义的_usage后缀的函数并执行.字母顺序显示
    for func in $(compgen -A function); do
        # 检查函数名是否以_usage结尾
        if [[ "$func" == *_usage ]]; then
            # 调用函数
            "$func"
        fi
    done

    # 常规帮助信息
    print_Usage

    this_show_start_end_timestamp=false
}

#################################################################################################
# 帮助信息显示函数:兼容多数网上copy的代码.
#################################################################################################
usage(){
    print_help
}
